In [3]:
import pandas as pd

In [ ]:
### Pandas is a data manipulation tool in python.
# it has two primary data structures-> series and dataframes.

In [6]:
### Series-> 1D array like object. It can hold any data type. Similar to column in a table.
data=[1,2,3,4,5]
series=pd.Series(data)
# converts the data into a series
print(series)
# it will print a single column, with its indexes.
# every element in data will be assigned an index, starting from 0.

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
numList=["one","two","three","four","five"]
series2=pd.Series(numList)
print(series2)

0      one
1      two
2    three
3     four
4     five
dtype: object

In [11]:
## creating a series from dictionary
data={
    "name":"Aadrish",
    "age":21,
    "interest":"Data Science",
    "year": "4th year"
}

seriesdict=pd.Series(data)
print(seriesdict)
# so while converting a dictionary into series, the 'key' of the dictionary, becomes the index and the values of dictionary, becomes values in Series

name             Aadrish
age                   21
interest    Data Science
year            4th year
dtype: object

In [13]:
# specifying the index
data=[10,20,30,40,50]
indexList=["a","b","c","d","e"] # this will be my index for given data
values=pd.Series(data,index=indexList) # passing the data and indexList as my parameter
print(values)
# see that the values from indexList has formed corresponding indexes for my data values

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [14]:
### Dataframe
# as you saw, series is a 1D structure with multiple rows and single columns.
# dataframe is a 2D structure with multiple rows and columns. it is also hetereogenous as it can hold multiple datatypes.

In [18]:
# creating a dataframe from dictionary of lists
data={
    "Name":["Aadrish","John","Jack"],
    "Age":[21,25,30],
    "City":["Kolkata","Mumbai","Bangalore"]
}

# here see that we have 3 columns-> 'Name', 'Age' and 'City'
# and also we have 3 rows -> 'Aadrish',21,'Kolkata' 
#                            'John',25,'Mumbai'
#                            'Jack',30,'Bangalore'

# now converting into a DataFrame
df=pd.DataFrame(data)
# like I said, the corresponding rows and columns are created
# abd default indexing is also applied
print(df)

      Name  Age       City
0  Aadrish   21    Kolkata
1     John   25     Mumbai
2     Jack   30  Bangalore

In [19]:
# creating a dataframe from a list of dictionaries
data =[
    {"Name":"Aadrish","Age":21,"City":"Kolkata"}, # this forms row->0, and the keys form columns
    {"Name":"John","Age":27,"City":"Mumbai"},     # this forms row->1
    {"Name":"Jack","Age":31,"City":"New York"}    # this forms row->2
]

df1=pd.DataFrame(data)

# the keys are converted into columns, and the values are rows from each dictionary, and there is ofc default indexing
print(df1)

      Name  Age      City
0  Aadrish   21   Kolkata
1     John   27    Mumbai
2     Jack   31  New York

In [ ]:
# in real world scenarios, we'll be working with large datasets and csv files.
# now let's learn reading csv files using pandas
# here we are using 'sales_data.csv' available on kaggle

In [6]:
# reading the csv file as df (it'll be read as DataFrame since it has multiple rows and columns)
df=pd.read_csv("sales_data.csv")

# getting only the first 5 entries from the dataset
print(df.head(5))

   Transaction ID        Date Product Category             Product Name  \
0           10001  2024-01-01      Electronics            iPhone 14 Pro
1           10002  2024-01-02  Home Appliances         Dyson V11 Vacuum
2           10003  2024-01-03         Clothing         Levi's 501 Jeans
3           10004  2024-01-04            Books        The Da Vinci Code
4           10005  2024-01-05  Beauty Products  Neutrogena Skincare Set

   Units Sold  Unit Price  Total Revenue         Region Payment Method
0           2      999.99        1999.98  North America    Credit Card
1           1      499.99         499.99         Europe         PayPal
2           3       69.99         209.97           Asia     Debit Card
3           4       15.99          63.96  North America    Credit Card
4           1       89.99          89.99         Europe         PayPal

In [7]:
# getting the last 5 entries from the dataset
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [46]:
# how to access elements from a dataframe
# here we are using a smaller dataset
data={
    "Name":["Aadrish","John","Jack"],
    "Age":[21,25,30],
    "City":["Kolkata","Mumbai","Bangalore"]
}

df=pd.DataFrame(data)
print(df)

      Name  Age       City
0  Aadrish   21    Kolkata
1     John   25     Mumbai
2     Jack   30  Bangalore

In [ ]:
# accessing elements from a specific column
print(df["Name"])
# and since this displays a single column, so its type becomes-> Series

0    Aadrish
1       John
2       Jack
Name: Name, dtype: object

In [ ]:
# accessing elements from a single row, using row index

print(df.loc[1]) # this will show us details from the row, with index=1

Name      John
Age         25
City    Mumbai
Name: 1, dtype: object

In [21]:
print(df.iloc[1]) # index location 
                  # it prints the values with respect to index->1

# here, row index and index location has matching values so both prints the same data

Name      John
Age         25
City    Mumbai
Name: 1, dtype: object

In [25]:
# Accessing a specified element

# using at[rowIndex,'columnName']

print(df.at[1,"Age"]) # gets the element from 'Age' column and row index->1

25

In [24]:
# using iat[rowIndex,columnIndex]

print(df.iat[1,2]) # gets the element from row index->1 and column index->2

Mumbai

In [26]:
### Data Manipulation with DataFrames
# currently we have df as
df

      Name  Age       City
0  Aadrish   21    Kolkata
1     John   25     Mumbai
2     Jack   30  Bangalore

In [29]:
# now suppose we want to add a new column 'salary'
df['Salary']=[50000,60000,70000]
# the salaries wil be assigned according to index
# 50000 -> index 0
# 60000 -> index 1
# 70000 -> index 2

In [30]:
df

      Name  Age       City  Salary
0  Aadrish   21    Kolkata   50000
1     John   25     Mumbai   60000
2     Jack   30  Bangalore   70000

In [ ]:
# deleting a column
df.drop("Salary")
# throws an error, since by default it searches in the row axis for the 'Salary' entry

KeyError: "['Salary'] not found in axis"

In [34]:
df.drop('Salary',axis=1) # setting axis=1, allows it to search in column axis for an entry 'Salary' and delete it

      Name  Age       City
0  Aadrish   21    Kolkata
1     John   25     Mumbai
2     Jack   30  Bangalore

In [47]:
df
# stil we see that salary column is there. Hence, the drop operation was not permanent

      Name  Age       City
0  Aadrish   21    Kolkata
1     John   25     Mumbai
2     Jack   30  Bangalore

In [38]:
# add 'inplace=True' to make the drop operation permanent
df.drop('Salary',axis=1,inplace=True)

In [48]:
df # see now the salary column is removed permanently

      Name  Age       City
0  Aadrish   21    Kolkata
1     John   25     Mumbai
2     Jack   30  Bangalore

In [49]:
# adding +1 to all values in age column
df["Age"]=df["Age"] + 1
df

      Name  Age       City
0  Aadrish   22    Kolkata
1     John   26     Mumbai
2     Jack   31  Bangalore

In [50]:
# how you can view statistical summary
df=pd.read_csv("sales_data.csv")
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [53]:
statisticalSummary=df.describe()
print(statisticalSummary)
# it gives the statistical summary for every column; count for every column; mean for every column; and so on 
# statistical parameters for every column

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000